app/services/api_request_auth.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def user
    @user ||= User.find(decoded_auth_token[:user_id]) if decoded_auth_token

SELECT "validate_jwt_tokens".* FROM "validate_jwt_tokens" WHERE "validate_jwt_tokens"."token" = $1  [["token", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoxLCJleHAiOjE2MjE3MzExMzF9.iY20FzKPokUWYp5y0XOEFkSga9h_Exgkt3KH7FHVu5k"]]
---
  def verify_token(token)
    jwt = ValidateJwtToken.where(token: token).present?