app/controllers/api/v1/ratings_controller.rb

    def index
        @ratings = Rating.where(location_id: params[:location_id])
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."location_id" = $1  [["location_id", 1]]

    def create
        @rating = Rating.new(rating_params)
        @rating.user_id = @current_user.id

        if @rating.save
---
INSERT INTO "ratings" ("user_id", "location_id", "rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["location_id", 2], ["rate", 2.1], ["created_at", "2021-05-22 03:53:16.140472"], ["updated_at", "2021-05-22 03:53:16.140472"]]

    def find_rating
        @rating = Rating.find_by_id(params[:location_id])
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]