app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
      @users = User.all

INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      @user = User.new(user_params)
      auth_token = JsonWebToken.encode(user_id: @user.id)
      if @user.save

UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "user_two@email.com"], ["password_digest", "$2a$12$tsXa.2u/Wx2ureg9rimlZ.NiA81inxChTCFZ9roQR/hFfDBM8xFjS"], ["updated_at", "2021-05-22 23:02:28.649696"], ["id", 1]]
---
    def update
      unless @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "1"], ["LIMIT", 1]]
---
    def find_user
      params[:_username]
      @user = User.find_by_username!(params[:_username])